# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas

import numpy as np

import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [2]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:

salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
# Your code here:

salaries.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [5]:
# Your code here:

salaries["Salary or Hourly"].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [6]:
# Your code here:

grouped_data = salaries.groupby("Department").count()

grouped_data["Salary or Hourly"]

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Salary or Hourly, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [7]:
# Your code here:

from scipy.stats import t
from scipy.stats import ttest_1samp  # testeo de una muestra frente a poblacion

In [8]:
hourly_rate = salaries["Hourly Rate"].dropna()

In [20]:
hourly_rate.mean()

32.78855771628024

In [21]:
mu = 30

mu

30

In [22]:
t_test = ttest_1samp(hourly_rate, mu, alternative='two-sided')

t_test

TtestResult(statistic=20.6198057854942, pvalue=4.3230240486229894e-92, df=8021)

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [14]:
# Your code here:

# H0 = Salaries are higher than 86000 

# H1 = Salaries are not higher than 86000

mu = 86000

annual_salaries = salaries["Annual Salary"].dropna()

t_test = ttest_1samp(annual_salaries, mu, alternative='less')

t_test

# Since 0.9 > 0.05 we cannot reject H0

TtestResult(statistic=5.932870515690814, pvalue=0.9999999984921207, df=25160)

Using the `crosstab` function, find the department that has the most hourly workers.

In [15]:
# Your code here:

variable_1 = salaries["Department"]
variable_2 = salaries["Typical Hours"]

# Create a cross-tabulation table using the crosstab function
cross_tab = pd.crosstab(variable_1, variable_2)

# Print the cross-tabulation table
print(cross_tab)

Typical Hours          10.0  20.0  35.0  40.0
Department
ANIMAL CONTRL             1    18     0     0
AVIATION                  0    18    15  1049
BUDGET & MGMT             0     0     2     0
BUSINESS AFFAIRS          0     7     0     0
CITY COUNCIL              7    36    18     3
COMMUNITY DEVELOPMENT     0     3     1     0
CULTURAL AFFAIRS          0     0     7     0
FAMILY & SUPPORT          0   286     0     1
FINANCE                   0     2     0    42
FIRE                      0     0     0     2
GENERAL SERVICES          0     0     0   765
HEALTH                    0     0     3     0
HUMAN RESOURCES           0     2     2     0
LAW                       0     1    39     0
MAYOR'S OFFICE            0     1     7     0
OEMC                      0  1229     0    44
POLICE                    0    10     0     0
PROCUREMENT               0     0     0     2
PUBLIC LIBRARY            0   288     0    11
STREETS & SAN           176     0    10  1676
TRANSPORTN                0     0     0   725
WATER MGMNT               0     0     0  1513

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [16]:
# Your code here:

salaries_water = salaries[salaries["Department"] == "WATER MGMNT"]

salaries_water

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
16,"ABDUL-KARIM, MUHAMMAD A",ENGINEERING TECHNICIAN VI,WATER MGMNT,F,Salary,NaN,111492.0,NaN
20,"ABDULSATTAR, MUDHAR",CIVIL ENGINEER II,WATER MGMNT,F,Salary,NaN,65448.0,NaN
30,"ABRAHAM, GIRLEY T",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
40,"ABRAMS, TIFFANY",OPERATING ENGINEER-GROUP C,WATER MGMNT,F,Hourly,40.0,NaN,45.07
...,...,...,...,...,...,...,...,...
33104,"ZIZUMBO, DANIEL",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,35.60
33125,"ZOTTA, SANDINO",MECHANICAL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
33132,"ZUBECK, JOHN",PLUMBER,WATER MGMNT,F,Hourly,40.0,NaN,48.25
33158,"ZUNO, ERIK",CONSTRUCTION LABORER,WATER MGMNT,F,Hourly,40.0,NaN,40.20
33169,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,35.60

In [29]:
# H0: The salary is not less than 35 

# H1: The salary is less than 35

typical_hours = salaries["Typical Hours"].dropna()

mu = 35

t_test = ttest_1samp(typical_hours, mu, alternative='less')

t_test

# Since p-value < 0.05 we can reject H0

TtestResult(statistic=-4.766685873371244, pvalue=9.528902490143399e-07, df=8021)

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [36]:
# Your code here:
from statsmodels.stats import weightstats as w

hourly_rate = salaries["Hourly Rate"].dropna()

t.interval(0.95,                 # alfa = 1 - pvalor, confianza
           len(hourly_rate)-1,     #  N-1, dof
           loc=hourly_rate.mean(),
           scale=sem(hourly_rate)
           )

(32.52345834488425, 33.05365708767623)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [37]:
# Your code here:

annual_salary = salaries["Annual Salary"].dropna()

t.interval(0.95,                 # alfa = 1 - pvalor, confianza
           len(annual_salary)-1,     #  N-1, dof
           loc=annual_salary.mean(),
           scale=sem(annual_salary)
           )

(86526.99656774187, 87047.00301256099)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [42]:
# Your code here:

# Â¿la proporcion de a es distinta del 25%?

# H0 : No
# H1 : Si, es distinta la proporcion

from statsmodels.stats.proportion import proportions_ztest

salaries["Salary or Hourly"].value_counts()[1]

z_score, p_value= proportions_ztest(salaries["Salary or Hourly"].value_counts()[1],     # 25 elementos de a, 
                                    len(salaries["Salary or Hourly"]),  # numero total de elementos
                                    0.25            # proporcion
                                   ) 

z_score, p_value

# Rechazamos H0. Es distinta al 25 %

(-3.5099964213703005, 0.0004481127249057967)

In [40]:
salaries["Salary or Hourly"].value_counts()[1]

8022